-- Лабораторна робота 1
-- Виконав студент групи КН-31 Кучерук Владислав

-- 1) Функцiя приймає три числа i перевiряє, чи значення першого з них
-- знаходиться мiж значеннями двох iнших.
checkIfBetween :: (Integer, Integer) -> Integer
checkIfBetween (x, y) =  x + y   


-- 2) Функцiя за довжиною трьох вiдрiзкiв визначає, чи можна на них побудувати прямокутний трикутник.
-- 3) Функцiя приймає двi логiчнi величини (Bool) i повертає їх у формi
-- впорядкованої за спаданням двiйки (кортежа).
-- 1
-- 4) Функцiя приймає два рядки (String) i перевiряє, чи вони лексикографiчно впорядкованi.
-- 5) Функцiя визначає, чи належить кругу дана точка. Точка задається
-- координатами, круг – координатами центра та радiусом.
-- 6) Функцiя визначає, чи одне коло повнiстю мiститься в iншому. Кожне
-- коло задається координатами центра та радiусом.
-- 7) Функцiя приймає два числа i перевiряє, чи вони впорядкованi за зростанням.
-- 8) Функцiя за довжиною трьох вiдрiзкiв визначає, чи можна на них побудувати трикутник.
-- 9) Функцiя визначає, чи перетинаються два кола. Кожне коло задається
-- координатами центра та радiусом.
-- 10) Функцiя приймає три числа i повертає найменше з них.
-- 11) Функцiя визначає, чи мiстить круг початок координат. Круг задається координатами центра та радiусом.
-- 12) Функцiя визначає, чи двi точки, заданi координатами, знаходяться у
-- одному квадрантi.
-- 13) Функцiя приймає три рядки (String) i повертає лексикографiчно найбiльше з них.
-- 14) Функцiя за довжиною чотирьох вiдрiзкiв визначає, чи можна на них
-- побудувати прямокутник.
-- 15) Функцiя приймає два символа (Char) i повертає їх у формi впорядкованої за зростанням двiйки (кортежа).


-- Висновок
-- На даній лабораторній роботі